[
  "eting of Shareholders to be held in 2025, which definitive proxy statement shall be filed with the Securities and Exchange Commission within 120 days after the end of the fiscal year to which this Report relates. Table of Contents AMAZON.COM, INC. FORM 10-K For the Fiscal Year Ended December 31, 2024 INDEX Page PART I Item 1. Business 3 Item 1A. Risk Factors 6 Item 1B. Unresolved Staff Comments 16 Item 1C. Cybersecurity 17 Item 2. Properties 18 Item 3. Legal Proceedings 18 Item 4. Mine Safety Disclosures 18 PART II Item 5. Market for the Registrant’s Common Stock, Related Shareholder Matters, and Issuer Purchases of Equity Securities 19 Item 6. Reserved 19 Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations 20 Item 7A. Quantitative and Qualitative Disclosures About Market Risk 31 Item 8. Financial Statements and Supplementary Data 33 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure 70 Item 9A. Controls and Procedures 70 Item 9B. Other Information 72 Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections 72 PART III Item 10. Directors, Executive Officers, and Corporate Governance 72 Item 11. Executive Compensation 72 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Shareholder Matters 72 Item 13. Certain Relationships and Related Transactions, and Director Independence 72 Item 14. Principal Accountant Fees and Services 73 PART IV Item 15. Exhibits, Financial Statement Schedules 74 Item 16. Form 10-K Summary 76 Signatures 77 2 Table of Contents AMAZON.COM, INC. PART I Item 1. Business This Annual Report on Form 10-K and the documents incorporated herein by reference contain forward-looking statements based on expectations, estimates, and projections as of the date of this filing. Actual results and outcomes may differ materially from those expressed in forward-looking statements. See Item 1A of Part I — “Risk Factors.” As used herein, “Amazon.com,” “we,” “our,” and similar terms include Amazon.com, Inc. and its subsidiaries, unless the context indicates otherwise. General We seek to be Earth’s most customer-centric company. We are guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. In each of our segments, we serve our primary customer sets, consisting of consumers, sellers, developers, enterprises, content creators, advertisers, and employees. We have organized our operations into three segments: North America, International, and Amazon Web Services (“AWS”). These segments reflect the way the Company evaluates its business performance and manages its operations. Information on our net sales is contained in Item 8 of Part II, “Financial Statements and Supplementary Data — Note 10 — Segment Information.” Consumers We serve consumers through our online and physical stores and focus on selection, price, and convenience. We design our stores to enable hundreds of millions of unique products to be sold by us and by third parties across dozens of product categories. Customers access our offerings through our websites, mobile apps, Alexa, devices, streaming, and physically visiting our stores. We also manufacture and sell electronic d",
  "t I — “Risk Factors.” As used herein, “Amazon.com,” “we,” “our,” and similar terms include Amazon.com, Inc. and its subsidiaries, unless the context indicates otherwise. General We seek to be Earth’s most customer-centric company. We are guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. In each of our segments, we serve our primary customer sets, consisting of consumers, sellers, developers, enterprises, content creators, advertisers, and employees. We have organized our operations into three segments: North America, International, and Amazon Web Services (“AWS”). These segments reflect the way the Company evaluates its business performance and manages its operations. Information on our net sales is contained in Item 8 of Part II, “Financial Statements and Supplementary Data — Note 10 — Segment Information.” Consumers We serve consumers through our online and physical stores and focus on selection, price, and convenience. We design our stores to enable hundreds of millions of unique products to be sold by us and by third parties across dozens of product categories. Customers access our offerings through our websites, mobile apps, Alexa, devices, streaming, and physically visiting our stores. We also manufacture and sell electronic devices, including Kindle, Fire tablet, Fire TV, Echo, Ring, Blink, and eero, and we develop and produce media content. We seek to offer our customers low prices, fast and free delivery, easy-to-use functionality, and timely customer service. In addition, we offer subscription services such as Amazon Prime, a membership program that includes fast, free shipping on tens of millions of items, access to award-winning movies and series, live sports, and other benefits. We fulfill customer orders in a number of ways, including through: North America and International fulfillment networks that we operate; co-sourced and outsourced arrangements in certain countries; digital delivery; and through our physical stores. We operate customer service centers globally, which are supplemented by co-sourced arrangements. See Item 2 of Part I, “Properties.” Sellers We offer programs that enable sellers to grow their businesses, sell their products in our stores, and fulfill orders using our services. We are not the seller of record in these transactions. We earn fixed fees, a percentage of sales, per-unit activity fees, interest, or some combination thereof, for our seller programs. Developers and Enterprises We serve developers and enterprises of all sizes, including start-ups, government agencies, and academic institutions, through AWS, which offers a broad set of on-demand technology services, including compute, storage, database, analytics, and machine learning, and other services. Content Creators We offer programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Advertisers We provide advertising services to sellers, vendors, publishers, authors, and others, through programs such as sponsored ads, display, and video advertising. 3 Table of Contents Competition Our businesses encompass a large variety of product types, service offerings, and delivery",
  ",771 1,802 International Physical stores (2) 23,975 707 North America Physical stores (2) 222 — International Fulfillment, data centers, and other 448,168 36,869 North America Fulfillment, data centers, and other 176,287 18,958 International Total 701,974 67,440 ___________________ (1) For leased properties, represents the total leased space excluding sub-leased space. (2) This includes 618 North America and 27 International stores as of December 31, 2024. Segment Leased Square Footage (1) Owned Square Footage (1) North America 457,104 20,741 International 166,673 11,741 AWS 24,875 24,052 Total 648,652 56,534 ___________________ (1) Segment amounts exclude corporate facilities. Shared facilities are allocated among the segments based on usage and primarily relate to facilities that hold our technology infrastructure. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 10 — Segment Information.” We own and lease our corporate headquarters in Washington’s Puget Sound region and Arlington, Virginia. Item 3. Legal Proceedings See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 7 — Commitments and Contingencies — Legal Proceedings.” Item 4. Mine Safety Disclosures Not applicable. 18 Table of Contents PART II Item 5. Market for the Registrant’s Common Stock, Related Shareholder Matters, and Issuer Purchases of Equity Securities Market Information Our common stock is traded on the Nasdaq Global Select Market under the symbol “AMZN.” Holders As of January 29, 2025, there were 12,135 shareholders of record of our common stock, although there is a much larger number of beneficial owners. Recent Sales of Unregistered Securities None. Issuer Purchases of Equity Securities None. Item 6. Reserved 19 Table of Contents Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations Forward-Looking Statements This Annual Report on Form 10-K includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact, including statements regarding guidance, industry prospects, or future results of operations or financial position, made in this Annual Report on Form 10-K are forward-looking. We use words such as anticipates, believes, expects, future, intends, and similar expressions to identify forward-looking statements. Forward-looking statements reflect management’s current expectations and are inherently uncertain. Actual results and outcomes could differ materially for a variety of reasons, including, among others, fluctuations in foreign exchange rates, changes in global economic conditions and customer demand and spending, inflation, interest rates, regional labor market constraints, world events, the rate of growth of the internet, online commerce, cloud services, and new and emerging technologies, the amount that Amazon.com invests in new business opportunities and the timing of those investments, the mix of products and services sold to customers, the mix of net sales derived from products as compared with services, the extent to which we owe income or other taxes, competition, management of growth, potential fluctuations in operating results, international growth and expansion, the outcomes of claims, litigation, g",
  "rnational Total 701,974 67,440 ___________________ (1) For leased properties, represents the total leased space excluding sub-leased space. (2) This includes 618 North America and 27 International stores as of December 31, 2024. Segment Leased Square Footage (1) Owned Square Footage (1) North America 457,104 20,741 International 166,673 11,741 AWS 24,875 24,052 Total 648,652 56,534 ___________________ (1) Segment amounts exclude corporate facilities. Shared facilities are allocated among the segments based on usage and primarily relate to facilities that hold our technology infrastructure. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 10 — Segment Information.” We own and lease our corporate headquarters in Washington’s Puget Sound region and Arlington, Virginia. Item 3. Legal Proceedings See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 7 — Commitments and Contingencies — Legal Proceedings.” Item 4. Mine Safety Disclosures Not applicable. 18 Table of Contents PART II Item 5. Market for the Registrant’s Common Stock, Related Shareholder Matters, and Issuer Purchases of Equity Securities Market Information Our common stock is traded on the Nasdaq Global Select Market under the symbol “AMZN.” Holders As of January 29, 2025, there were 12,135 shareholders of record of our common stock, although there is a much larger number of beneficial owners. Recent Sales of Unregistered Securities None. Issuer Purchases of Equity Securities None. Item 6. Reserved 19 Table of Contents Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations Forward-Looking Statements This Annual Report on Form 10-K includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact, including statements regarding guidance, industry prospects, or future results of operations or financial position, made in this Annual Report on Form 10-K are forward-looking. We use words such as anticipates, believes, expects, future, intends, and similar expressions to identify forward-looking statements. Forward-looking statements reflect management’s current expectations and are inherently uncertain. Actual results and outcomes could differ materially for a variety of reasons, including, among others, fluctuations in foreign exchange rates, changes in global economic conditions and customer demand and spending, inflation, interest rates, regional labor market constraints, world events, the rate of growth of the internet, online commerce, cloud services, and new and emerging technologies, the amount that Amazon.com invests in new business opportunities and the timing of those investments, the mix of products and services sold to customers, the mix of net sales derived from products as compared with services, the extent to which we owe income or other taxes, competition, management of growth, potential fluctuations in operating results, international growth and expansion, the outcomes of claims, litigation, government investigations, and other proceedings, fulfillment, sortation, delivery, and data center optimization, risks of inventory management, variability in demand, the degree to which we enter into, maintain, and develop commerci",
  "our international locations, our consolidated net sales and operating expenses will be lower than if currencies had remained constant. We believe that our increasing diversification beyond the U.S. economy through our growing international businesses benefits our shareholders over the long-term. We also believe it is useful to evaluate our operating results and growth rates before and after the effect of currency changes. In addition, the remeasurement of our intercompany balances can result in significant gains and losses associated with the effect of movements in foreign exchange rates. Currency volatilities may continue, which may significantly impact (either positively or negatively) our reported results and consolidated trends and comparisons. For additional information about each line item addressed above, refer to Item 8 of Part II, “Financial Statements and Supplementary Data — Note 1 — Description of Business, Accounting Policies, and Supplemental Disclosures.” Our Annual Report on Form 10-K for the year ended December 31, 2023 includes a discussion and analysis of our financial condition and results of operations for the year ended December 31, 2022 in Item 7 of Part II, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” Critical Accounting Estimates The preparation of financial statements in conformity with generally accepted accounting principles of the United States (“GAAP”) requires estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses, and related disclosures of contingent liabilities in the consolidated financial statements and accompanying notes. Critical accounting estimates are those estimates made in accordance with GAAP that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on the financial condition or results of operations of the Company. Based on this definition, we have identified the critical accounting estimates addressed below. We also have other key accounting policies, which involve the use of estimates, judgments, and assumptions that are significant to understanding our results. For additional information, see Item 8 of Part II, “Financial Statements and Supplementary Data — Note 1 — Description of Business, Accounting Policies, and Supplemental Disclosures.” Although we believe that our estimates, assumptions, and judgments are reasonable, they are based upon information presently available. Actual results may differ significantly from these estimates under different assumptions, judgments, or conditions. Inventories Inventories, consisting of products available for sale, are primarily accounted for using the first-in first-out method, and are valued at the lower of cost and net realizable value. This valuation requires us to make judgments, based on currently available information, about the likely method of disposition, such as through sales to individual customers, returns to product 21 Table of Contents vendors, or liquidations, and expected recoverable values of each disposition category. These assumptions about future disposition of inventory are inherently uncertain and changes in our estimates and assumptions may cause us to realize material write-downs in the future. As a me",
  "ng principles of the United States (“GAAP”) requires estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses, and related disclosures of contingent liabilities in the consolidated financial statements and accompanying notes. Critical accounting estimates are those estimates made in accordance with GAAP that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on the financial condition or results of operations of the Company. Based on this definition, we have identified the critical accounting estimates addressed below. We also have other key accounting policies, which involve the use of estimates, judgments, and assumptions that are significant to understanding our results. For additional information, see Item 8 of Part II, “Financial Statements and Supplementary Data — Note 1 — Description of Business, Accounting Policies, and Supplemental Disclosures.” Although we believe that our estimates, assumptions, and judgments are reasonable, they are based upon information presently available. Actual results may differ significantly from these estimates under different assumptions, judgments, or conditions. Inventories Inventories, consisting of products available for sale, are primarily accounted for using the first-in first-out method, and are valued at the lower of cost and net realizable value. This valuation requires us to make judgments, based on currently available information, about the likely method of disposition, such as through sales to individual customers, returns to product 21 Table of Contents vendors, or liquidations, and expected recoverable values of each disposition category. These assumptions about future disposition of inventory are inherently uncertain and changes in our estimates and assumptions may cause us to realize material write-downs in the future. As a measure of sensitivity, for every 1% of additional inventory valuation allowance as of December 31, 2024, we would have recorded an additional cost of sales of approximately $365 million. In addition, we enter into supplier commitments for certain electronic device components and certain products. These commitments are based on forecasted customer demand. If we reduce these commitments, we may incur additional costs. Income Taxes We are subject to income taxes in the U.S. (federal and state) and numerous foreign jurisdictions. Tax laws, regulations, administrative practices, principles, and interpretations in various jurisdictions may be subject to significant change, with or without notice, due to economic, political, and other conditions, and significant judgment is required in evaluating and estimating our provision and accruals for these taxes. There are many transactions that occur during the ordinary course of business for which the ultimate tax determination is uncertain. In addition, our actual and forecasted earnings are subject to change due to economic, political, and other conditions and significant judgment is required in determining our ability to use our deferred tax assets. Our effective tax rates could be affected by numerous factors, such as changes in our business operations, acquisitions, investments, entry into new businesses and geographies, intercompany transact",
  "nvested $1.3 billion in a third convertible note, and will invest an additional $2.7 billion by Q4 2025. Cash provided by (used in) financing activities was $(15.9) billion and $(11.8) billion in 2023 and 2024. Cash inflows from financing activities resulted from proceeds from short-term debt, and other and long-term-debt of $18.1 billion and $5.1 billion in 2023 and 2024. Cash outflows from financing activities resulted from payments of short-term debt, and other, long-term debt, finance leases, and financing obligations of $34.0 billion and $17.0 billion in 2023 and 2024. Property and equipment acquired under finance leases was $642 million and $854 million in 2023 and 2024. We had no borrowings outstanding under the two unsecured revolving credit facilities or the commercial paper programs as of December 31, 2024. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 6 — Debt” for additional information. As of December 31, 2024, cash, cash equivalents, and marketable securities held by foreign subsidiaries were $6.3 billion. We intend to invest substantially all of our foreign subsidiary earnings, as well as our capital in our foreign subsidiaries, indefinitely outside of the U.S. in those jurisdictions in which we would incur significant, additional costs upon repatriation of such amounts. Our U.S. taxable income is reduced by accelerated depreciation deductions and increased by the impact of capitalized research and development expenses. U.S. tax rules provide for enhanced accelerated depreciation deductions by allowing us to expense a portion of qualified property, primarily equipment. These enhanced deductions are scheduled to phase out annually from 2023 through 2026. Our federal tax provision included accelerated depreciation deductions for 2022, 2023, and 2024. Additionally, effective January 1, 2022, research and development expenses are required to be capitalized and amortized for U.S. tax purposes, which delays the deductibility of these expenses. Cash paid for U.S. (federal and state) and foreign income taxes (net of refunds) totaled $11.2 billion and $12.3 billion for 2023 and 2024. As of December 31, 2023 and 2024, restricted cash, cash equivalents, and marketable securities were $503 million and $3.5 billion. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 6 — Debt” and “Financial Statements and Supplementary Data — Note 7 — Commitments and Contingencies” for additional discussion of our principal contractual commitments, as well as our pledged assets. Additionally, we have purchase obligations and open purchase orders, including for inventory and capital expenditures, that support normal operations and are primarily due in the next twelve months. These purchase obligations and open purchase orders are generally cancellable in full or in part through the contractual provisions. We believe that cash flows generated from operations and our cash, cash equivalents, and marketable securities balances, as well as our borrowing arrangements, will be sufficient to meet our anticipated operating cash needs for at least the next twelve months. However, any projections of future cash needs and cash flows are subject to substantial uncertainty. See Item 1A of Part I, “Risk Factors.” We continually evaluate opportunities",
  "rch and development expenses. U.S. tax rules provide for enhanced accelerated depreciation deductions by allowing us to expense a portion of qualified property, primarily equipment. These enhanced deductions are scheduled to phase out annually from 2023 through 2026. Our federal tax provision included accelerated depreciation deductions for 2022, 2023, and 2024. Additionally, effective January 1, 2022, research and development expenses are required to be capitalized and amortized for U.S. tax purposes, which delays the deductibility of these expenses. Cash paid for U.S. (federal and state) and foreign income taxes (net of refunds) totaled $11.2 billion and $12.3 billion for 2023 and 2024. As of December 31, 2023 and 2024, restricted cash, cash equivalents, and marketable securities were $503 million and $3.5 billion. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 6 — Debt” and “Financial Statements and Supplementary Data — Note 7 — Commitments and Contingencies” for additional discussion of our principal contractual commitments, as well as our pledged assets. Additionally, we have purchase obligations and open purchase orders, including for inventory and capital expenditures, that support normal operations and are primarily due in the next twelve months. These purchase obligations and open purchase orders are generally cancellable in full or in part through the contractual provisions. We believe that cash flows generated from operations and our cash, cash equivalents, and marketable securities balances, as well as our borrowing arrangements, will be sufficient to meet our anticipated operating cash needs for at least the next twelve months. However, any projections of future cash needs and cash flows are subject to substantial uncertainty. See Item 1A of Part I, “Risk Factors.” We continually evaluate opportunities to sell additional equity or debt securities, obtain credit facilities, obtain finance and operating lease arrangements, enter into financing obligations, repurchase common stock, pay dividends, or repurchase, refinance, or otherwise restructure our debt for strategic reasons or to further strengthen our financial position. The sale of additional equity or convertible debt securities would be dilutive to our shareholders. In addition, we will, from time to time, consider the acquisition of, or investment in, complementary businesses, products, services, capital infrastructure, and technologies, which might affect our liquidity requirements or cause us to secure additional financing, or issue additional equity or debt securities. There can be no assurance that additional credit lines or financing instruments will be available in amounts or on terms acceptable to us, if at all. In addition, economic conditions and actions by policymaking bodies are contributing to changing interest rates and significant capital market volatility, which, along with any increases in our borrowing levels, could increase our future borrowing costs. 23 Table of Contents Results of Operations We have organized our operations into three segments: North America, International, and AWS. These segments reflect the way the Company evaluates its business performance and manages its operations. See Item 8 of Part II, “Financial Statements and Supplementary Data — No",
  "s, capital infrastructure, and technologies, which might affect our liquidity requirements or cause us to secure additional financing, or issue additional equity or debt securities. There can be no assurance that additional credit lines or financing instruments will be available in amounts or on terms acceptable to us, if at all. In addition, economic conditions and actions by policymaking bodies are contributing to changing interest rates and significant capital market volatility, which, along with any increases in our borrowing levels, could increase our future borrowing costs. 23 Table of Contents Results of Operations We have organized our operations into three segments: North America, International, and AWS. These segments reflect the way the Company evaluates its business performance and manages its operations. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 10 — Segment Information.” Overview Macroeconomic factors, including changes in inflation and interest rates, global economic and geopolitical developments, and the development and adoption of technologies and services, including artificial intelligence, have direct and indirect impacts on our results of operations that are difficult to isolate and quantify. These could affect customer demand for our products and services, our ability to predict growth needs, expenses, and the benefits we gain from new technologies. We expect some or all of them to continue to impact our operations into Q1 2025. Net Sales Net sales include product and service sales. Product sales represent revenue from the sale of products and related shipping fees and digital media content where we record revenue gross. Service sales primarily represent third-party seller fees, which includes commissions and any related fulfillment and shipping fees, AWS sales, advertising services, Amazon Prime membership fees, and certain digital media content subscriptions. Net sales information is as follows (in millions): Year Ended December 31, 2023 2024 Net Sales: North America $ 352,828 $ 387,497 International 131,200 142,906 AWS 90,757 107,556 Consolidated $ 574,785 $ 637,959 Year-over-year Percentage Growth: North America 12 % 10 % International 11 9 AWS 13 19 Consolidated 12 11 Year-over-year Percentage Growth, excluding the effect of foreign exchange rates: North America 12 % 10 % International 11 10 AWS 13 19 Consolidated 12 11 Net Sales Mix: North America 61 % 61 % International 23 22 AWS 16 17 Consolidated 100 % 100 % Sales increased 11% in 2024, compared to the prior year. Changes in foreign exchange rates reduced net sales by $2.3 billion in 2024. For a discussion of the effect of foreign exchange rates on sales growth, see “Effect of Foreign Exchange Rates” below. North America sales increased 10% in 2024, compared to the prior year. The sales growth primarily reflects increased unit sales, including sales by third-party sellers, advertising sales, and subscription services. Increased unit sales were driven largely by our continued focus on price, selection, and convenience for our customers, including from our fast shipping offers. Changes in foreign exchange rates reduced North America net sales by $462 million in 2024. International sales increased 9% in 2024, compared to the prior year. The sales growth primarily",
  "ructure that was primarily driven by additional investments to support AWS business growth. Changes in foreign exchange rates positively impacted operating income by $240 million in 2024. Interest Income and Expense Our interest income was $2.9 billion and $4.7 billion during 2023 and 2024, primarily due to a higher average balance of invested funds at prevailing rates. We generally invest our excess cash in investment grade short- to intermediate-term marketable debt securities and AAA-rated money market funds. Our interest income corresponds with the average balance of invested funds based on the prevailing rates, which vary depending on the geographies and currencies in which they are invested. Interest expense was $3.2 billion and $2.4 billion in 2023 and 2024 and was primarily related to debt and finance leases. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 4 — Leases and Note 6 — Debt” for additional information. Our long-term lease liabilities were $77.3 billion and $78.3 billion as of December 31, 2023 and 2024. Our long-term debt was $58.3 billion and $52.6 billion as of December 31, 2023 and 2024. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 4 — Leases and Note 6 — Debt” for additional information. Other Income (Expense), Net Other income (expense), net was $938 million and $(2.3) billion during 2023 and 2024. The primary components of other income (expense), net are related to equity securities valuations and adjustments, equity warrant valuations, and foreign currency. Included in other income (expense), net in 2023 and 2024 is a marketable equity securities valuation gain (loss) of $797 million and $(1.6) billion from our equity investment in Rivian. 27 Table of Contents Income Taxes Our effective tax rate is subject to significant variation due to several factors, including variability in our pre-tax and taxable income and loss and the mix of jurisdictions to which they relate, intercompany transactions, the applicability of special tax regimes, changes in how we do business, acquisitions, investments, developments in tax controversies, changes in our stock price, changes in our deferred tax assets and liabilities and their valuation, foreign currency gains (losses), changes in statutes, regulations, case law, and administrative practices, principles, and interpretations related to tax, including changes to the global tax framework, competition, and other laws and accounting rules in various jurisdictions, and relative changes of expenses or losses for which tax benefits are not recognized. Our effective tax rate can be more or less volatile based on the amount of pre-tax income or loss. For example, the impact of discrete items and non-deductible expenses on our effective tax rate is greater when our pre-tax income is lower. In addition, we record valuation allowances against deferred tax assets when there is uncertainty about our ability to generate future income in relevant jurisdictions. We recorded a provision (benefit) for income taxes of $7.1 billion and $9.3 billion in 2023 and 2024. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 9 — Income Taxes” for additional information. Non-GAAP Financial Measures Regulation G, Conditions for Use of Non-GAAP Financial Measures,",
  "balance of invested funds at prevailing rates. We generally invest our excess cash in investment grade short- to intermediate-term marketable debt securities and AAA-rated money market funds. Our interest income corresponds with the average balance of invested funds based on the prevailing rates, which vary depending on the geographies and currencies in which they are invested. Interest expense was $3.2 billion and $2.4 billion in 2023 and 2024 and was primarily related to debt and finance leases. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 4 — Leases and Note 6 — Debt” for additional information. Our long-term lease liabilities were $77.3 billion and $78.3 billion as of December 31, 2023 and 2024. Our long-term debt was $58.3 billion and $52.6 billion as of December 31, 2023 and 2024. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 4 — Leases and Note 6 — Debt” for additional information. Other Income (Expense), Net Other income (expense), net was $938 million and $(2.3) billion during 2023 and 2024. The primary components of other income (expense), net are related to equity securities valuations and adjustments, equity warrant valuations, and foreign currency. Included in other income (expense), net in 2023 and 2024 is a marketable equity securities valuation gain (loss) of $797 million and $(1.6) billion from our equity investment in Rivian. 27 Table of Contents Income Taxes Our effective tax rate is subject to significant variation due to several factors, including variability in our pre-tax and taxable income and loss and the mix of jurisdictions to which they relate, intercompany transactions, the applicability of special tax regimes, changes in how we do business, acquisitions, investments, developments in tax controversies, changes in our stock price, changes in our deferred tax assets and liabilities and their valuation, foreign currency gains (losses), changes in statutes, regulations, case law, and administrative practices, principles, and interpretations related to tax, including changes to the global tax framework, competition, and other laws and accounting rules in various jurisdictions, and relative changes of expenses or losses for which tax benefits are not recognized. Our effective tax rate can be more or less volatile based on the amount of pre-tax income or loss. For example, the impact of discrete items and non-deductible expenses on our effective tax rate is greater when our pre-tax income is lower. In addition, we record valuation allowances against deferred tax assets when there is uncertainty about our ability to generate future income in relevant jurisdictions. We recorded a provision (benefit) for income taxes of $7.1 billion and $9.3 billion in 2023 and 2024. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 9 — Income Taxes” for additional information. Non-GAAP Financial Measures Regulation G, Conditions for Use of Non-GAAP Financial Measures, and other SEC regulations define and prescribe the conditions for use of certain non-GAAP financial information. Our measures of free cash flows and the effect of foreign exchange rates on our consolidated statements of operations meet the definition of non-GAAP financial measures. We provide multiple measures of free cash",
  "tatutes, regulations, case law, and administrative practices, principles, and interpretations related to tax, including changes to the global tax framework, competition, and other laws and accounting rules in various jurisdictions, and relative changes of expenses or losses for which tax benefits are not recognized. Our effective tax rate can be more or less volatile based on the amount of pre-tax income or loss. For example, the impact of discrete items and non-deductible expenses on our effective tax rate is greater when our pre-tax income is lower. In addition, we record valuation allowances against deferred tax assets when there is uncertainty about our ability to generate future income in relevant jurisdictions. We recorded a provision (benefit) for income taxes of $7.1 billion and $9.3 billion in 2023 and 2024. See Item 8 of Part II, “Financial Statements and Supplementary Data — Note 9 — Income Taxes” for additional information. Non-GAAP Financial Measures Regulation G, Conditions for Use of Non-GAAP Financial Measures, and other SEC regulations define and prescribe the conditions for use of certain non-GAAP financial information. Our measures of free cash flows and the effect of foreign exchange rates on our consolidated statements of operations meet the definition of non-GAAP financial measures. We provide multiple measures of free cash flows because we believe these measures provide additional perspective on the impact of acquiring property and equipment with cash and through finance leases and financing obligations. Free Cash Flow Free cash flow is cash flow from operations reduced by “Purchases of property and equipment, net of proceeds from sales and incentives.” The following is a reconciliation of free cash flow to the most comparable GAAP cash flow measure, “Net cash provided by (used in) operating activities,” for 2023 and 2024 (in millions): Year Ended December 31, 2023 2024 Net cash provided by (used in) operating activities $ 84,946 $ 115,877 Purchases of property and equipment, net of proceeds from sales and incentives (48,133) (77,658) Free cash flow $ 36,813 $ 38,219 Net cash provided by (used in) investing activities $ (49,833) $ (94,342) Net cash provided by (used in) financing activities $ (15,879) $ (11,812) Free Cash Flow Less Principal Repayments of Finance Leases and Financing Obligations Free cash flow less principal repayments of finance leases and financing obligations is free cash flow reduced by “Principal repayments of finance leases” and “Principal repayments of financing obligations.” Principal repayments of finance leases and financing obligations approximates the actual payments of cash for our finance leases and financing obligations. The following is a reconciliation of free cash flow less principal repayments of finance leases and financing obligations to the most comparable GAAP cash flow measure, “Net cash provided by (used in) operating activities,” for 2023 and 2024 (in millions): Year Ended December 31, 2023 2024 Net cash provided by (used in) operating activities $ 84,946 $ 115,877 Purchases of property and equipment, net of proceeds from sales and incentives (48,133) (77,658) Free cash flow 36,813 38,219 Principal repayments of finance leases (4,384) (2,043) Principal repayments of financing obligations (271) (669) Free cas"
]