[
  "by reference in this Form 10-K in response to Items 10, 11, 12, 13 and 14 of Part III. Form 10-K Index Part I Page Item 1. Business . 1 Overview 1 Business segments & Co rpo rate 1 Competition 1 Supervision and regulation 2-7 Human capital 8-9 Distribution of assets, liabilities and stockholders’ equity; interest rates and interest differentials 322-326 Item 1A. Risk Factors. 10-37 Item 1B. Unresolved Staff Comments. 38 Item 2. Properties. 38 Item 3. Legal Proceedings. 38 Item 4. Mine Safety Disclosures. 38 Part II Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities. 39 Item 6. Reserved 39 Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. 39 Item 7A. Quantitative and Qualitative Disclosures About Market Risk. 39 Item 8. Financial Statements and Supplementary Data. 40 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure. 40 Item 9A. Controls and Procedures. 40 Item 9B. Other Information. 41 Item 9C. Disclosure regarding Foreign Jurisdictions that Prevent Inspections. 41 Part III Item 10. Directors, Executive Officers and Corporate Governance. 42 Item 11. Executive Compensation. 43 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters. 43 Item 13. Certain Relationships and Related Transactions, and Director Independence. 43 Item 14. Principal Accounting Fees and Services. 43 Part IV Item 15. Exhibits, Financial Statement Schedules. 44-47 Part I Item 1. Business. Overview JPMorgan Chase & Co. (“JPMorganChase” or the “Firm”, NYSE: JPM), a financial holding company incorporated under Delaware law in 1968, is a leading financial services firm based in the United States of America (“U.S.”), with operations worldwide. JPMorganChase had $4.0 trillion in assets and $344.8 billion in stockholders’ equity as of December 31, 2024. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing and asset management. Under the J.P. Morgan and Chase brands, the Firm serves millions of customers, predominantly in the U.S., and many of the world’s most prominent corporate, institutional and government clients globally. JPMorganChase’s principal bank subsidiary is JPMorgan Chase Bank, National Association (“JPMorgan Chase Bank, N.A.”), a national banking association with U.S. branches in 48 states and Washington, D.C. JPMorganChase’s principal non-bank subsidiary is J.P. Morgan Securities LLC (“J.P. Morgan Securities”), a U.S. broker-dealer. The bank and non-bank subsidiaries of JPMorganChase operate nationally as well as through overseas branches and subsidiaries, representative offices and subsidiary foreign banks. The Firm’s principal operating subsidiaries outside the U.S. are J.P. Morgan Securities plc and J.P. Morgan SE (“JPMSE”), which are subsidiaries of JPMorgan Chase Bank, N.A. and are based in the United Kingdom (“U.K.”) and Germany, respectively. The Firm’s website is www.jpmorganchase.com. JPMorganChase makes available on its website, free of charge, annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K pursuant to Section 13(a) or Section 15(d) of the Secur",
  "e prior Board authorization was canceled when the new $30 billion repurchase program was authorized by the Board of Directors effective July 1, 2024. Item 6. Reserved Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. Management’s discussion and analysis of financial condition and results of operations, entitled “Management’s discussion and analysis,” appears on pages 52–167. Such information should be read in conjunction with the Consolidated Financial Statements and Notes thereto, which appear on pages 172–321. Item 7A. Quantitative and Qualitative Disclosures About Market Risk. Refer to the Market Risk Management section of Management’s discussion and analysis on pages 141–149 for a discussion of quantitative and qualitative disclosures about market risk. 39 Parts II and III Item 8. Financial Statements and Supplementary Data. The Consolidated Financial Statements, together with the Notes thereto and the report thereon dated February 14, 2025, of PricewaterhouseCoopers LLP, the Firm’s independent registered public accounting firm (PCAOB ID 238 ), appear on pages 169–321. The “Glossary of Terms and Acronyms’’ is included on pages 327–333. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure. None. Item 9A. Controls and Procedures. The internal control framework promulgated by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”), “Internal Control — Integrated Framework” (“COSO 2013”), provides guidance for designing, implementing and conducting internal control and assessing its effectiveness. The Firm used the COSO 2013 framework to assess the effectiveness of the Firm’s internal control over financial reporting as of December 31, 2024. Refer to “Management’s report on internal control over financial reporting” on page 168. As of the end of the period covered by this report, an evaluation was carried out under the supervision and with the participation of the Firm’s management, including its Chairman and Chief Executive Officer and its Chief Financial Officer, of the effectiveness of its disclosure controls and procedures (as defined in Rule 13a-15(e) under the Securities Exchange Act of 1934). Based on that evaluation, the Chairman and Chief Executive Officer and the Chief Financial Officer concluded that these disclosure controls and procedures were effective. Refer to Exhibits 31.1 and 31.2 for the Certifications furnished by the Chairman and Chief Executive Officer and Chief Financial Officer, respectively. The Firm is committed to maintaining high standards of internal control over financial reporting. Nevertheless, because of its inherent limitations, internal control over financial reporting may not prevent or detect all misstatements. Deficiencies or lapses in internal controls may occur from time to time, and there can be no assurance that any such deficiencies will not result in significant deficiencies or material weaknesses in internal control in the future and collateral consequences therefrom. Refer to “Management’s report on internal control over financial reporting” on page 168 for further information. There was no change in the Firm’s internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934",
  "e restricted stock units or performance stock units granted under the shareholder-approved Long-Term Incentive Plan (“LTIP”), as amended and restated effective May 21, 2024. Refer to Note 9 for further information. (b) Represents shares available for future issuance under the shareholder-approved LTIP. All shares available for future issuance will be issued under the shareholder-approved LTIP. Refer to Note 9 for further discussion. Item 13. Certain Relationships and Related Transactions, and Director Independence. Refer to Item 10. Item 14. Principal Accounting Fees and Services. Refer to Item 10. 43 Part IV Item 15. Exhibits, Financial Statement Schedules. 1 Financial statements The Consolidated Financial Statements, the Notes thereto and the report of the Independent Registered Public Accounting Firm thereon listed in Item 8 are set forth commencing on page 169. 2 Financial statement schedules 3 Exhibits 3.1 Restated Certificate of Incorporation of JPMorgan Chase & Co., effective April 5, 2006 (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed April 7, 2006). 3.2 Amendment to the Restated Certificate of Incorporation of JPMorgan Chase & Co., effective June 7, 2013 (incorporated by reference to Appendix F to the Proxy Statement on Schedule 14A of JPMorgan Chase & Co. (File No. 1-5805) filed April 10, 2013). 3.3 Certificate of Designations for Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series CC (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed October 20, 2017). 3.4 Certificate of Designations for 5.75% Non-Cumulative Preferred Stock, Series DD (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed September 21, 2018). 3.5 Certificate of Designations for 6.00% Non-Cumulative Preferred Stock, Series EE (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed January 24, 2019). 3.6 Certificate of Designations for 4.75% Non-Cumulative Preferred Stock, Series GG (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed November 7, 2019). 3.7 Certificate of Designations for Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series II (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed February 24, 2020). 3.8 Certificate of Designations for 4.55% Non-Cumulative Preferred Stock, Series JJ (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed March 17, 2021). 3.90 Certificate of Designations for 3.65% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series KK (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed May 12, 2021). 3.10 Certificate of Designations for 4.625% Non-Cumulative Preferred Stock, Series LL (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed May 20, 2021). 3.11 Certificate of Designations for 4.20% Non-Cumulative Preferre",
  "ge Act. ☒ Large accelerated filer ☐ Accelerated filer ☐ Non-accelerated filer ☐ Smaller reporting company ☐ Emerging growth company If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐ Indicate by check mark whether the registrant has filed a report on and attestation to its management’s assessment of the effectiveness of its internal control over financial reporting under Section 404(b) of the Sarbanes-Oxley Act (15 U.S.C. 7262(b)) by the registered public accounting firm that prepared or issued its audit report. ☒ Yes ☐ No If securities are registered pursuant to Section 12(b) of the Act, indicate by check mark whether the financial statements of the registrant included in the filing reflect the correction of an error to previously issued financial statements. ☐ Indicate by check mark whether any of those error corrections are restatements that required a recovery analysis of incentive-based compensation received by any of the registrant’s executive officers during the relevant recovery period pursuant to §240.10D-1 (b). ☐ Indicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act). ☐ Yes ☒ No The aggregate market value of JPMorgan Chase & Co. common stock held by non-affiliates as of June 30, 2024: $ 573,443,601,053 Number of shares of common stock outstanding as of January 31, 2025: 2,796,106,099 Documents incorporated by reference: Portions of the registrant’s Proxy Statement for the annual meeting of stockholders to be held on May 20, 2025, are incorporated by reference in this Form 10-K in response to Items 10, 11, 12, 13 and 14 of Part III. Form 10-K Index Part I Page Item 1. Business . 1 Overview 1 Business segments & Co rpo rate 1 Competition 1 Supervision and regulation 2-7 Human capital 8-9 Distribution of assets, liabilities and stockholders’ equity; interest rates and interest differentials 322-326 Item 1A. Risk Factors. 10-37 Item 1B. Unresolved Staff Comments. 38 Item 2. Properties. 38 Item 3. Legal Proceedings. 38 Item 4. Mine Safety Disclosures. 38 Part II Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities. 39 Item 6. Reserved 39 Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. 39 Item 7A. Quantitative and Qualitative Disclosures About Market Risk. 39 Item 8. Financial Statements and Supplementary Data. 40 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure. 40 Item 9A. Controls and Procedures. 40 Item 9B. Other Information. 41 Item 9C. Disclosure regarding Foreign Jurisdictions that Prevent Inspections. 41 Part III Item 10. Directors, Executive Officers and Corporate Governance. 42 Item 11. Executive Compensation. 43 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters. 43 Item 13. Certain Relationships and Related Transactions, and Director Independence. 43 Item 14. Principal Accounting Fees and Services. 43 Part IV Item 15. Exhibits, Financial Statement Schedules. 44-47 Part I Item 1. Business. Overview J",
  "rowth company If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐ Indicate by check mark whether the registrant has filed a report on and attestation to its management’s assessment of the effectiveness of its internal control over financial reporting under Section 404(b) of the Sarbanes-Oxley Act (15 U.S.C. 7262(b)) by the registered public accounting firm that prepared or issued its audit report. ☒ Yes ☐ No If securities are registered pursuant to Section 12(b) of the Act, indicate by check mark whether the financial statements of the registrant included in the filing reflect the correction of an error to previously issued financial statements. ☐ Indicate by check mark whether any of those error corrections are restatements that required a recovery analysis of incentive-based compensation received by any of the registrant’s executive officers during the relevant recovery period pursuant to §240.10D-1 (b). ☐ Indicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act). ☐ Yes ☒ No The aggregate market value of JPMorgan Chase & Co. common stock held by non-affiliates as of June 30, 2024: $ 573,443,601,053 Number of shares of common stock outstanding as of January 31, 2025: 2,796,106,099 Documents incorporated by reference: Portions of the registrant’s Proxy Statement for the annual meeting of stockholders to be held on May 20, 2025, are incorporated by reference in this Form 10-K in response to Items 10, 11, 12, 13 and 14 of Part III. Form 10-K Index Part I Page Item 1. Business . 1 Overview 1 Business segments & Co rpo rate 1 Competition 1 Supervision and regulation 2-7 Human capital 8-9 Distribution of assets, liabilities and stockholders’ equity; interest rates and interest differentials 322-326 Item 1A. Risk Factors. 10-37 Item 1B. Unresolved Staff Comments. 38 Item 2. Properties. 38 Item 3. Legal Proceedings. 38 Item 4. Mine Safety Disclosures. 38 Part II Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities. 39 Item 6. Reserved 39 Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. 39 Item 7A. Quantitative and Qualitative Disclosures About Market Risk. 39 Item 8. Financial Statements and Supplementary Data. 40 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure. 40 Item 9A. Controls and Procedures. 40 Item 9B. Other Information. 41 Item 9C. Disclosure regarding Foreign Jurisdictions that Prevent Inspections. 41 Part III Item 10. Directors, Executive Officers and Corporate Governance. 42 Item 11. Executive Compensation. 43 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters. 43 Item 13. Certain Relationships and Related Transactions, and Director Independence. 43 Item 14. Principal Accounting Fees and Services. 43 Part IV Item 15. Exhibits, Financial Statement Schedules. 44-47 Part I Item 1. Business. Overview JPMorgan Chase & Co. (“JPMorganChase” or the “Firm”, NYSE: JPM), a financial holding company incorporated under Delawar",
  "rence in this Form 10-K in response to Items 10, 11, 12, 13 and 14 of Part III. Form 10-K Index Part I Page Item 1. Business . 1 Overview 1 Business segments & Co rpo rate 1 Competition 1 Supervision and regulation 2-7 Human capital 8-9 Distribution of assets, liabilities and stockholders’ equity; interest rates and interest differentials 322-326 Item 1A. Risk Factors. 10-37 Item 1B. Unresolved Staff Comments. 38 Item 2. Properties. 38 Item 3. Legal Proceedings. 38 Item 4. Mine Safety Disclosures. 38 Part II Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities. 39 Item 6. Reserved 39 Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. 39 Item 7A. Quantitative and Qualitative Disclosures About Market Risk. 39 Item 8. Financial Statements and Supplementary Data. 40 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure. 40 Item 9A. Controls and Procedures. 40 Item 9B. Other Information. 41 Item 9C. Disclosure regarding Foreign Jurisdictions that Prevent Inspections. 41 Part III Item 10. Directors, Executive Officers and Corporate Governance. 42 Item 11. Executive Compensation. 43 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters. 43 Item 13. Certain Relationships and Related Transactions, and Director Independence. 43 Item 14. Principal Accounting Fees and Services. 43 Part IV Item 15. Exhibits, Financial Statement Schedules. 44-47 Part I Item 1. Business. Overview JPMorgan Chase & Co. (“JPMorganChase” or the “Firm”, NYSE: JPM), a financial holding company incorporated under Delaware law in 1968, is a leading financial services firm based in the United States of America (“U.S.”), with operations worldwide. JPMorganChase had $4.0 trillion in assets and $344.8 billion in stockholders’ equity as of December 31, 2024. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing and asset management. Under the J.P. Morgan and Chase brands, the Firm serves millions of customers, predominantly in the U.S., and many of the world’s most prominent corporate, institutional and government clients globally. JPMorganChase’s principal bank subsidiary is JPMorgan Chase Bank, National Association (“JPMorgan Chase Bank, N.A.”), a national banking association with U.S. branches in 48 states and Washington, D.C. JPMorganChase’s principal non-bank subsidiary is J.P. Morgan Securities LLC (“J.P. Morgan Securities”), a U.S. broker-dealer. The bank and non-bank subsidiaries of JPMorganChase operate nationally as well as through overseas branches and subsidiaries, representative offices and subsidiary foreign banks. The Firm’s principal operating subsidiaries outside the U.S. are J.P. Morgan Securities plc and J.P. Morgan SE (“JPMSE”), which are subsidiaries of JPMorgan Chase Bank, N.A. and are based in the United Kingdom (“U.K.”) and Germany, respectively. The Firm’s website is www.jpmorganchase.com. JPMorganChase makes available on its website, free of charge, annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K pursuant to Section 13(a) or Section 15(d) of the Securities Ex",
  "s. • Operational risks, including risks associated with JPMorganChase’s dependence on its operational systems and its employees, as well as the systems and employees of third parties, market participants and service providers; the potential negative effects of failing to identify and address operational risks related to the failure of internal or external operational systems, the introduction of or changes to products, services and delivery platforms or the adoption of new technologies; risks related to safeguarding personal information; the harm that could be caused by a successful cyber attack affecting JPMorganChase or by other extraordinary events; risks associated with JPMorganChase’s risk management framework and control environment, its models and estimations and associated judgments used in its stress testing and financial statements, and controls over disclosure and financial reporting; and potential adverse effects of failing to comply with applicable standards for the oversight of vendors and other service providers. • Strategic risks, including the damage to JPMorganChase’s competitive standing and results that could occur if management fails to develop and execute effective business strategies; risks associated with the significant and increasing competition that JPMorganChase faces; and the potential adverse impacts of climate change on the 10 effectiveness of JPMorganChase’s existing business strategies with respect to its operations, clients and customers. • Conduct risks, including the negative impact that can result from the actions or misconduct of employees, including any failure of employees to conduct themselves in accordance with JPMorganChase’s expectations, policies and practices. • Reputation risks, including the potential adverse effects on JPMorganChase’s relationships with its clients, customers, shareholders, regulators and other stakeholders that could arise from employee misconduct, security breaches, inadequate risk management, compliance or operational failures, litigation and regulatory investigations, failure to satisfy expectations concerning environmental, social and governance concerns, failure to effectively manage conflicts of interest or to satisfy fiduciary obligations, or other factors that could damage JPMorganChase’s reputation. • Country risks, including potential impacts on JPMorganChase’s businesses from an outbreak or escalation of hostilities between countries or within a country or region; and the potential adverse effects of local economic, political, regulatory and social factors on JPMorganChase’s business and revenues in certain countries in which it operates. • People risks, including the criticality of attracting and retaining qualified employees; and the potential adverse effects of unfavorable changes in immigration or travel policies on JPMorganChase’s workforce. • Legal risks, including those relating to litigation and regulatory and government investigations. The above summary is subject in its entirety to the discussion of the risk factors set forth below . Regulatory JPMorganChase’s businesses are highly regulated, and the laws, rules and regulations that apply to JPMorganChase have a significant impact on its business and operations. JPMorganChase is a financial services firm with operations worldwide. JPMor",
  "edit losses and higher net charge-offs, which can reduce JPMorganChase’s earnings. Data quality is essential to JPMorganChase’s business and operations, and if JPMorganChase fails to maintain adequate data management processes, this could adversely affect its ability to effectively manage its businesses, comply with applicable laws, rules and regulations, or remain competitive. JPMorganChase relies on accurate, timely and complete data to effectively operate its systems and processes, including: • assessing risk exposures and limits • monitoring and detecting fraudulent transactions and cyber threats • developing or maintaining models and other analytical and judgment-based estimations, including those that use machine learning or artificial intelligence • implementing and maintaining compliance programs, and • preparing financial statements, disclosures and regulatory reports, as well as internal reporting Any deficiencies in JPMorganChase’s data management processes, including with respect to the accuracy or completeness of data, the timeliness of data collection, the analysis or validation of data, or the safeguarding of data could undermine the reliability and effectiveness of its operations, including: • risk management practices, including inaccurate or untimely risk reporting • delivery of regulatory reporting or internal or external financial reporting • compliance practices, such as those relating to transaction monitoring, customer screening, blocking and rejecting transactions, recordkeeping or reporting • business activities, such as those related to managing JPMorganChase's market-making positions and liquidity and capital levels, including reliance on timely data for informed decision-making • providing services to clients and customers, including transaction processing, lending services, account management and customer support, or • fraud detection and prevention processes. Any or all of these factors could impair the ability of JPMorganChase to make sound business decisions, cause it to incur higher operational and compliance costs, result in operational breakdowns or failure to meet its regulatory requirements, negatively affect clients and customers, or lead to reputational harm. Enhanced regulatory and other standards for the oversight of vendors and other service providers can result in higher costs and other potential exposures. JPMorganChase must comply with enhanced regulatory and other standards associated with doing 28 business with vendors and other service providers, including standards relating to the outsourcing of functions as well as the performance of significant banking and other functions by subsidiaries. JPMorganChase incurs significant costs and expenses in connection with its initiatives to address the risks associated with oversight of its internal and external service providers. JPMorganChase’s failure to appropriately assess and manage these relationships, especially those involving significant banking functions, shared services or other critical activities, could materially adversely affect JPMorganChase. Specifically, any such failure could result in: • potential harm to clients and customers, and any liability associated with that harm • regulatory fines, penalties or other sanctions • lower revenues, and the opportunity cost from",
  "many models used by JPMorganChase are based on assumptions regarding historical correlations among prices of various asset classes or other market indicators. In times of market stress, including difficult or less liquid market environments, or in the event of other unforeseen circumstances, previously uncorrelated indicators may become correlated. Conversely, previously-correlated indicators may become uncorrelated at those times. Sudden market movements and unanticipated market or economic events could, in some circumstances, limit the effectiveness of JPMorganChase’s risk management strategies, causing it to incur losses. JPMorganChase could recognize unexpected losses, its capital levels could be reduced and it could face greater regulatory scrutiny if its models, estimations or judgments, including those used in its financial statements, are inadequate or incorrect. JPMorganChase has developed and uses a variety of models and other analytical and judgment-based estimations to measure, monitor and implement controls over its market, credit, capital, liquidity, operational and other risks. JPMorganChase also uses internal models and estimations as a basis for its stress testing and in connection with the preparation of its financial statements under U.S. generally accepted accounting principles (“U.S. GAAP”). These models and estimations are based on a variety of assumptions and historical trends, and are periodically reviewed and modified as necessary. The models and estimations that JPMorganChase uses, including those that use machine learning or artificial intelligence, may not be effective in all cases to identify, observe and mitigate risk due to a variety of factors, such as: • reliance on historical trends that may not persist in the future, including assumptions underlying the models and estimations such as correlations among certain market indicators or asset prices • inherent limitations associated with forecasting uncertain economic and financial outcomes • historical trend information may be incomplete, or may not be indicative of severely negative market conditions such as extreme volatility, dislocation or lack of liquidity • sudden illiquidity in markets or declines in prices of certain loans and securities may make it more difficult to value certain financial instruments • technology that is introduced to run models or estimations may not perform as expected, or may not be well understood by the personnel using the technology • models and estimations may contain erroneous data, valuations, formulas or algorithms • review processes may fail to detect flaws in models and estimations, and 29 Part I • models may inadvertently incorporate biases present in data used in the models. JPMorganChase may experience unexpected losses if models, estimates or judgments used or applied in connection with its risk management activities or the preparation of its financial statements are inadequate or incorrect. For example, where quoted market prices are not available for certain financial instruments that require a determination of their fair value, JPMorganChase may make fair value determinations based on internally developed models or other means which ultimately rely to some degree on management estimates and judgment. In addition, JPMorganChase may experience increa",
  "elated at those times. Sudden market movements and unanticipated market or economic events could, in some circumstances, limit the effectiveness of JPMorganChase’s risk management strategies, causing it to incur losses. JPMorganChase could recognize unexpected losses, its capital levels could be reduced and it could face greater regulatory scrutiny if its models, estimations or judgments, including those used in its financial statements, are inadequate or incorrect. JPMorganChase has developed and uses a variety of models and other analytical and judgment-based estimations to measure, monitor and implement controls over its market, credit, capital, liquidity, operational and other risks. JPMorganChase also uses internal models and estimations as a basis for its stress testing and in connection with the preparation of its financial statements under U.S. generally accepted accounting principles (“U.S. GAAP”). These models and estimations are based on a variety of assumptions and historical trends, and are periodically reviewed and modified as necessary. The models and estimations that JPMorganChase uses, including those that use machine learning or artificial intelligence, may not be effective in all cases to identify, observe and mitigate risk due to a variety of factors, such as: • reliance on historical trends that may not persist in the future, including assumptions underlying the models and estimations such as correlations among certain market indicators or asset prices • inherent limitations associated with forecasting uncertain economic and financial outcomes • historical trend information may be incomplete, or may not be indicative of severely negative market conditions such as extreme volatility, dislocation or lack of liquidity • sudden illiquidity in markets or declines in prices of certain loans and securities may make it more difficult to value certain financial instruments • technology that is introduced to run models or estimations may not perform as expected, or may not be well understood by the personnel using the technology • models and estimations may contain erroneous data, valuations, formulas or algorithms • review processes may fail to detect flaws in models and estimations, and 29 Part I • models may inadvertently incorporate biases present in data used in the models. JPMorganChase may experience unexpected losses if models, estimates or judgments used or applied in connection with its risk management activities or the preparation of its financial statements are inadequate or incorrect. For example, where quoted market prices are not available for certain financial instruments that require a determination of their fair value, JPMorganChase may make fair value determinations based on internally developed models or other means which ultimately rely to some degree on management estimates and judgment. In addition, JPMorganChase may experience increased uncertainty in its estimates if assets acquired differ from those used to develop those models, which may lead to unexpected losses. Similarly, JPMorganChase establishes an allowance for expected credit losses related to its credit exposures which requires significant judgments, including forecasts of how macroeconomic conditions might impair the ability of JPMorganChase’s clients and customers to repay th",
  "verely negative market conditions such as extreme volatility, dislocation or lack of liquidity • sudden illiquidity in markets or declines in prices of certain loans and securities may make it more difficult to value certain financial instruments • technology that is introduced to run models or estimations may not perform as expected, or may not be well understood by the personnel using the technology • models and estimations may contain erroneous data, valuations, formulas or algorithms • review processes may fail to detect flaws in models and estimations, and 29 Part I • models may inadvertently incorporate biases present in data used in the models. JPMorganChase may experience unexpected losses if models, estimates or judgments used or applied in connection with its risk management activities or the preparation of its financial statements are inadequate or incorrect. For example, where quoted market prices are not available for certain financial instruments that require a determination of their fair value, JPMorganChase may make fair value determinations based on internally developed models or other means which ultimately rely to some degree on management estimates and judgment. In addition, JPMorganChase may experience increased uncertainty in its estimates if assets acquired differ from those used to develop those models, which may lead to unexpected losses. Similarly, JPMorganChase establishes an allowance for expected credit losses related to its credit exposures which requires significant judgments, including forecasts of how macroeconomic conditions might impair the ability of JPMorganChase’s clients and customers to repay their loans or other obligations. These types of estimates and judgments may not prove to be accurate due to a variety of factors, including when the current and forecasted environments are significantly different from the historical environments upon which the models were developed. The increased uncertainty may necessitate a greater degree of judgment and analytics to inform any adjustments that JPMorganChase may make to model outputs than would otherwise be the case. Some of the models and other analytical and judgment-based estimations used by JPMorganChase in managing risks are subject to review by, and require the approval of, JPMorganChase’s regulators. These reviews are required before JPMorganChase may use those models and estimations for calculating market risk RWA, credit risk RWA and operational risk RWA under Basel III. If JPMorganChase’s models or estimations are not approved by its regulators, it may be subject to higher capital charges, which could adversely affect its financial results or limit the ability to expand its businesses. Lapses, weaknesses or deficiencies in controls over disclosure or financial reporting could materially affect JPMorganChase’s profitability or reputation. JPMorganChase’s businesses and operations are subject to complex and evolving laws, rules and regulations, both within and outside the U.S., requiring continuous enhancements to various disclosures in its financial statements and regulatory reports. There can be no assurance that JPMorganChase’s disclosure controls and procedures will be effective in every circumstance, or that a material weakness or significant deficiency in internal control over f",
  "bject to review by, and require the approval of, JPMorganChase’s regulators. These reviews are required before JPMorganChase may use those models and estimations for calculating market risk RWA, credit risk RWA and operational risk RWA under Basel III. If JPMorganChase’s models or estimations are not approved by its regulators, it may be subject to higher capital charges, which could adversely affect its financial results or limit the ability to expand its businesses. Lapses, weaknesses or deficiencies in controls over disclosure or financial reporting could materially affect JPMorganChase’s profitability or reputation. JPMorganChase’s businesses and operations are subject to complex and evolving laws, rules and regulations, both within and outside the U.S., requiring continuous enhancements to various disclosures in its financial statements and regulatory reports. There can be no assurance that JPMorganChase’s disclosure controls and procedures will be effective in every circumstance, or that a material weakness or significant deficiency in internal control over financial reporting will not occur. Any such lapse, weakness or deficiency could result in inaccurate financial reporting which, in turn, could: • materially and adversely affect JPMorganChase’s business and results of operations or financial condition • restrict its ability to access the capital markets • require it to expend significant resources to correct the lapse, weakness or deficiency • expose it to litigation or regulatory fines, penalties or other sanctions • harm its reputation, or • otherwise diminish investor confidence in JPMorganChase. Strategic JPMorganChase’s results or competitive standing could suffer if its management fails to develop and execute effective business strategies, and to anticipate changes affecting those strategies. The development and execution of effective business strategies by JPMorganChase’s management, along with the ability to anticipate and respond to shifts in the competitive environment, are critical to JPMorganChase's competitive standing and to achieving its strategic objectives. These strategies relate to: • the products and services that JPMorganChase offers • the geographies in which it operates • the types of clients and customers that it serves • the businesses that it acquires or in which it invests • the counterparties with which it does business • the technologies that it adopts or in which it invests, which may include new and currently unproven technologies, and • the methods, distribution channels and third party service providers by or through which it offers products and services. If management makes choices about these strategies and goals that prove to be incorrect, are based on incomplete, inaccurate or fraudulent information, do not accurately assess the competitive landscape and industry trends, or fail to address changing regulatory and market environments or the expectations of clients, customers, investors, employees and other stakeholders, then the franchise values and growth prospects of JPMorganChase’s businesses may suffer and its earnings could decline. JPMorganChase’s growth prospects also depend on management’s ability to develop and execute effective business plans to address these strategic priorities, both in the near term and over longer"
]