[
  "art III of this Annual Report on Form 10-K to the extent stated herein. Such proxy statement will be filed with the Securities and Exchange Commission within 120 days of the registrant’s fiscal year ended December 31, 2024. TESLA, INC. ANNUAL REPORT ON FORM 10-K FOR THE YEAR ENDED DECEMBER 31, 2024 INDEX Page PART I. Item 1. Business 2 Item 1A. Risk Factors 13 Item 1B. Unresolved Staff Comments 27 Item 1 C. Cybersecurity 28 Item 2. Properties 29 Item 3. Legal Proceedings 29 Item 4. Mine Safety Disclosures 29 PART II. Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities 30 Item 6. [Reserved] 31 Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations 32 Item 7A. Quantitative and Qualitative Disclosures about Market Risk 44 Item 8. Financial Statements and Supplementary Data 45 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure 91 Item 9A. Controls and Procedures 91 Item 9B. Other Information 92 Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections 92 PART III. Item 10. Directors, Executive Officers and Corporate Governance 93 Item 11. Executive Compensation 93 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters 93 Item 13. Certain Relationships and Related Transactions, and Director Independence 93 Item 14. Principal Accountant Fees and Services 93 PART IV. Item 15. Exhibits and Financial Statement Schedules 94 Item 16. Form 10-K Summary 107 Signatures Table of Contents Forward-Looking Statements The discussions in this Annual Report on Form 10-K contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are based on assumptions with respect to the future and management’s current expectations, involve certain risks and uncertainties and are not guarantees. These forward-looking statements include, but are not limited to, statements concerning supply chain constraints, our strategy, competition, future operations and production capacity, future financial position, future revenues, projected costs, profitability, expected cost reductions, capital adequacy, expectations regarding demand and acceptance for our technologies, growth opportunities and trends in the markets in which we operate, prospects and plans and objectives of management. The words “anticipates,” “believes,” “could,” “estimates,” “expects,” “intends,” “may,” “plans,” “projects,” “will,” “would,” “predicts” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. We may not actually achieve the plans, intentions or expectations disclosed in our forward-looking statements and you should not place undue reliance on our forward-looking statements. Future results may differ materially from the plans, intentions and expectations disclosed in the forward-looking statements that we make. These forward-looking statements involve risks and uncertainties that could cause our actual results to differ materially from those in the forward-looking statements, including, without limitation, the risks set forth in Part I, Item 1A, “Risk Fac",
  "t of monetary assets and liabilities denominated in currencies that are not the local currency (primarily consisting of our intercompany and cash and cash equivalents balances). We considered the historical trends in foreign currency exchange rates and determined that it is reasonably possible that adverse changes in foreign currency exchange rates of 10% for all currencies could be experienced in the near-term. These changes were applied to our total monetary assets and liabilities denominated in currencies other than our local currencies at the balance sheet date to compute the impact these changes would have had on our net income before income taxes. These changes would have resulted in a gain or loss of $1.15 billion at December 31, 2024 and $1.01 billion at December 31, 2023, assuming no foreign currency hedging. 44 ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA Index to Consolidated Financial Statements Page Report of Independent Registered Public Accounting Firm (PCAOB ID: 238 ) 46 Consolidated Balance Sheets 48 Consolidated Statements of Operations 49 Consolidated Statements of Comprehensive Income 50 Consolidated Statements of Redeemable Noncontrolling Interests and Equity 51 Consolidated Statements of Cash Flows 52 Notes to Consolidated Financial Statements 53 45 Report of Independent Registered Public Accounting Firm To the Board of Directors and Stockholders of Tesla, Inc. Opinions on the Financial Statements and Internal Control over Financial Reporting We have audited the accompanying consolidated balance sheets of Tesla, Inc. and its subsidiaries (the \"Company\") as of December 31, 2024 and 2023, and the related consolidated statements of operations, of comprehensive income, of redeemable noncontrolling interests and equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO. Change in Accounting Principle As discussed in Note 2 to the consolidated financial statements, the Company changed the manner in which it accounts for digital assets in 2024. Basis for Opinions The Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management",
  "corporated herein by reference. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS The information required by this Item 12 of Form 10-K will be included in our 2025 Proxy Statement and is incorporated herein by reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE The information required by this Item 13 of Form 10-K will be included in our 2025 Proxy Statement and is incorporated herein by reference. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES The information required by this Item 14 of Form 10-K will be included in our 2025 Proxy Statement and is incorporated herein by reference. 93 PART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES 1. Financial statements (see Index to Consolidated Financial Statements in Part II, Item 8 of this report) 2. All financial statement schedules have been omitted since the required information was not applicable or was not present in amounts sufficient to require submission of the schedules, or because the information required is included in the consolidated financial statements or the accompanying notes 3. The exhibits listed in the following Index to Exhibits are filed or incorporated by reference as part of this report INDEX TO EXHIBITS Exhibit Number Incorporated by Reference Filed Herewith Exhibit Description Form File No. Exhibit Filing Date 3.1 Certificate of Formation of the Re gistrant 10-Q 001-34756 3.1 July 24, 2024 3.2 Bylaws of the Registrant. 10-Q 001-34756 3.2 July 24, 2024 4.1 Specimen common stock certificate of the Registrant. — — — — X 4.2 Fifth Amended and Restated Investors’ Rights Agreement, dated as of August 31, 2009, between Registrant and certain holders of the Registrant’s capital stock named therein. S-1 333-164593 4.2 January 29, 2010 4.3 Amendment to Fifth Amended and Restated Investors’ Rights Agreement, dated as of May 20, 2010, between Registrant and certain holders of the Registrant’s capital stock named therein. S-1/A 333-164593 4.2A May 27, 2010 4.4 Amendment to Fifth Amended and Restated Investors’ Rights Agreement between Registrant, Toyota Motor Corporation and certain holders of the Registrant’s capital stock named therein. S-1/A 333-164593 4.2B May 27, 2010 4.5 Amendment to Fifth Amended and Restated Investor’s Rights Agreement, dated as of June 14, 2010, between Registrant and certain holders of the Registrant’s capital stock named therein. S-1/A 333-164593 4.2C June 15, 2010 4.6 Amendment to Fifth Amended and Restated Investor’s Rights Agreement, dated as of November 2, 2010, between Registrant and certain holders of the Registrant’s capital stock named therein. 8-K 001-34756 4.1 November 4, 2010 4.7 Waiver to Fifth Amended and Restated Investor’s Rights Agreement, dated as of May 22, 2011, between Registrant and certain holders of the Registrant’s capital stock named therein. S-1/A 333-174466 4.2E June 2, 2011 94 Exhibit Number Incorporated by Reference Filed Herewith Exhibit Description Form File No. Exhibit Filing Date 4.8 Amendment to Fifth Amended and Restated Investor’s Rights Agreement, dated as of May 30, 2011, between Registrant and certain holders of the Registrant’s capital stock named therein. 8-K 001-34756 4.1 June 1, 2011 4.9 Sixth Amendment to Fifth Amended and Restated Investors’",
  "he Exchange Act: Large accelerated filer x Accelerated filer o Non-accelerated filer o Smaller reporting company o Emerging growth company o If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. o Indicate by check mark whether the Registrant has filed a report on and attestation to its management’s assessment of the effectiveness of its internal control over financial reporting under Section 404(b) of the Sarbanes-Oxley Act (15 U.S.C. 7262(b)) by the registered public accounting firm that prepared or issued its audit report. x If securities are registered pursuant to Section 12(b) of the Act, indicate by check mark whether the financial statements of the registrant included in the filing reflect the correction of an error to previously issued financial statements. o Indicate by check mark whether any of those error corrections are restatements that required a recovery analysis of incentive-based compensation received by any of the registrant’s executive officers during the relevant recovery period pursuant to §240.10D-1(b). o Indicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act). Yes o No x The aggregate market value of voting stock held by non-affiliates of the registrant, as of June 28, 2024, the last business day of the registrant’s most recently completed second fiscal quarter, was $ 550.17 billion (based on the closing price for shares of the registrant’s Common Stock as reported by the NASDAQ Global Select Market on June 28, 2024). Shares of Common Stock held by each executive officer and director have been excluded in that such persons may be deemed to be affiliates. This determination of affiliate status is not necessarily a conclusive determination for other purposes. As of January 22, 2025, there were 3,216,517,037 shares of the registrant’s common stock outstanding. DOCUMENTS INCORPORATED BY REFERENCE Portions of the registrant’s Proxy Statement for the 2025 Annual Meeting of Stockholders are incorporated herein by reference in Part III of this Annual Report on Form 10-K to the extent stated herein. Such proxy statement will be filed with the Securities and Exchange Commission within 120 days of the registrant’s fiscal year ended December 31, 2024. TESLA, INC. ANNUAL REPORT ON FORM 10-K FOR THE YEAR ENDED DECEMBER 31, 2024 INDEX Page PART I. Item 1. Business 2 Item 1A. Risk Factors 13 Item 1B. Unresolved Staff Comments 27 Item 1 C. Cybersecurity 28 Item 2. Properties 29 Item 3. Legal Proceedings 29 Item 4. Mine Safety Disclosures 29 PART II. Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities 30 Item 6. [Reserved] 31 Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations 32 Item 7A. Quantitative and Qualitative Disclosures about Market Risk 44 Item 8. Financial Statements and Supplementary Data 45 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure 91 Item 9A. Controls and Procedures 91 Item 9B. Other Information 92 Item 9C. Disclosure Regarding Foreign Jurisdictions t",
  "rging growth company o If an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. o Indicate by check mark whether the Registrant has filed a report on and attestation to its management’s assessment of the effectiveness of its internal control over financial reporting under Section 404(b) of the Sarbanes-Oxley Act (15 U.S.C. 7262(b)) by the registered public accounting firm that prepared or issued its audit report. x If securities are registered pursuant to Section 12(b) of the Act, indicate by check mark whether the financial statements of the registrant included in the filing reflect the correction of an error to previously issued financial statements. o Indicate by check mark whether any of those error corrections are restatements that required a recovery analysis of incentive-based compensation received by any of the registrant’s executive officers during the relevant recovery period pursuant to §240.10D-1(b). o Indicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act). Yes o No x The aggregate market value of voting stock held by non-affiliates of the registrant, as of June 28, 2024, the last business day of the registrant’s most recently completed second fiscal quarter, was $ 550.17 billion (based on the closing price for shares of the registrant’s Common Stock as reported by the NASDAQ Global Select Market on June 28, 2024). Shares of Common Stock held by each executive officer and director have been excluded in that such persons may be deemed to be affiliates. This determination of affiliate status is not necessarily a conclusive determination for other purposes. As of January 22, 2025, there were 3,216,517,037 shares of the registrant’s common stock outstanding. DOCUMENTS INCORPORATED BY REFERENCE Portions of the registrant’s Proxy Statement for the 2025 Annual Meeting of Stockholders are incorporated herein by reference in Part III of this Annual Report on Form 10-K to the extent stated herein. Such proxy statement will be filed with the Securities and Exchange Commission within 120 days of the registrant’s fiscal year ended December 31, 2024. TESLA, INC. ANNUAL REPORT ON FORM 10-K FOR THE YEAR ENDED DECEMBER 31, 2024 INDEX Page PART I. Item 1. Business 2 Item 1A. Risk Factors 13 Item 1B. Unresolved Staff Comments 27 Item 1 C. Cybersecurity 28 Item 2. Properties 29 Item 3. Legal Proceedings 29 Item 4. Mine Safety Disclosures 29 PART II. Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities 30 Item 6. [Reserved] 31 Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations 32 Item 7A. Quantitative and Qualitative Disclosures about Market Risk 44 Item 8. Financial Statements and Supplementary Data 45 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure 91 Item 9A. Controls and Procedures 91 Item 9B. Other Information 92 Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections 92 PART III. Item 10. Directors, Executive Officers and Corporate Governance 93 Item 11. Execu",
  "of this Annual Report on Form 10-K to the extent stated herein. Such proxy statement will be filed with the Securities and Exchange Commission within 120 days of the registrant’s fiscal year ended December 31, 2024. TESLA, INC. ANNUAL REPORT ON FORM 10-K FOR THE YEAR ENDED DECEMBER 31, 2024 INDEX Page PART I. Item 1. Business 2 Item 1A. Risk Factors 13 Item 1B. Unresolved Staff Comments 27 Item 1 C. Cybersecurity 28 Item 2. Properties 29 Item 3. Legal Proceedings 29 Item 4. Mine Safety Disclosures 29 PART II. Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities 30 Item 6. [Reserved] 31 Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations 32 Item 7A. Quantitative and Qualitative Disclosures about Market Risk 44 Item 8. Financial Statements and Supplementary Data 45 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure 91 Item 9A. Controls and Procedures 91 Item 9B. Other Information 92 Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections 92 PART III. Item 10. Directors, Executive Officers and Corporate Governance 93 Item 11. Executive Compensation 93 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters 93 Item 13. Certain Relationships and Related Transactions, and Director Independence 93 Item 14. Principal Accountant Fees and Services 93 PART IV. Item 15. Exhibits and Financial Statement Schedules 94 Item 16. Form 10-K Summary 107 Signatures Table of Contents Forward-Looking Statements The discussions in this Annual Report on Form 10-K contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are based on assumptions with respect to the future and management’s current expectations, involve certain risks and uncertainties and are not guarantees. These forward-looking statements include, but are not limited to, statements concerning supply chain constraints, our strategy, competition, future operations and production capacity, future financial position, future revenues, projected costs, profitability, expected cost reductions, capital adequacy, expectations regarding demand and acceptance for our technologies, growth opportunities and trends in the markets in which we operate, prospects and plans and objectives of management. The words “anticipates,” “believes,” “could,” “estimates,” “expects,” “intends,” “may,” “plans,” “projects,” “will,” “would,” “predicts” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. We may not actually achieve the plans, intentions or expectations disclosed in our forward-looking statements and you should not place undue reliance on our forward-looking statements. Future results may differ materially from the plans, intentions and expectations disclosed in the forward-looking statements that we make. These forward-looking statements involve risks and uncertainties that could cause our actual results to differ materially from those in the forward-looking statements, including, without limitation, the risks set forth in Part I, Item 1A, “Risk Factors” of",
  "arket conditions and may fluctuate due to various factors outside of our control, such as supply and demand and market speculation. We strive to execute long-term supply contracts for such materials at competitive pricing when feasible, and we currently believe that we have adequate access to raw materials supplies to meet the needs of our operations. Governmental Programs, Incentives and Regulations Globally, the ownership of our products by our customers is impacted by various government credits, incentives, and policies. Our business and products are also subject to numerous governmental regulations that vary among jurisdictions. The operation of our business is also impacted by various government programs, incentives, and other arrangements. See Note 2, Summary of Significant Accounting Policies , to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K for further details. Programs and Incentives Inflation Reduction Act On August 16, 2022, the Inflation Reduction Act of 2022 (“IRA”) was enacted into law and is effective for taxable years beginning after December 31, 2022, and remains subject to future guidance releases. The IRA includes multiple incentives to promote clean energy, electric vehicles, battery and energy storage manufacture or purchase, including through providing tax credits to consumers. For example, under current legislation, qualifying Tesla customers may receive up to $7,500 in federal tax credits for the purchase of qualified electric vehicles in the U.S. through 2032. Automotive Regulatory Credits We earn tradable credits in the operation of our business under various regulations related to zero-emission vehicles (“ZEVs”), greenhouse gas, fuel economy and clean fuel. We sell these credits to other regulated entities who can use the credits to comply with emission standards and other regulatory requirements. Sales of these credits are recognized within automotive regulatory credits revenue in our consolidated statements of operations included elsewhere in this Annual Report on Form 10-K. Energy Storage System Incentives and Policies While the regulatory regime for energy storage projects is still under development, there are various policies, incentives and financial mechanisms at the federal, state and local levels that support the adoption of energy storage. For example, energy storage systems that are charged using solar energy may be eligible for the solar energy-related U.S. federal tax credits described below. The Federal Energy Regulatory Commission (“FERC”) has also taken steps to enable the participation of energy storage in wholesale energy markets. In addition, California and a number of other states have adopted procurement targets for energy storage, and behind-the-meter energy storage systems qualify for funding under the California Self Generation Incentive Program. Our customers primarily benefit directly under these programs. In certain instances our customers may transfer such credits to us as contract consideration. In such transactions, they are included as a component of energy generation and storage revenues in our consolidated statements of operations included elsewhere in this Annual Report on Form 10-K. Pursuant to the IRA, under Sections 48, 48E and 25D of the Internal Revenue Code (”I",
  "ise and efficiency may result in our ability to manufacture our products using less of our currently installed equipment. Alternatively, as we ramp and mature the production of our products to higher levels, we may discontinue the use of already installed equipment in favor of different or additional equipment. The useful life of any equipment that would be retired early as a result would be shortened, causing the depreciation on such equipment to be accelerated, and our results of operations may be harmed. There is no guarantee that we will have sufficient cash flow from our business to pay our indebtedness or that we will not incur additional indebtedness. As of December 31, 2024, we and our subsidiaries had outstanding $7.91 billion in aggregate principal amount of indebtedness (see Note 10, Debt , to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K). Our consolidated indebtedness may increase our vulnerability to any generally adverse economic and industry conditions. We and our subsidiaries may, subject to the limitations in the terms of our existing and future indebtedness, incur additional debt, secure existing or future debt or recapitalize our debt. 22 Table of Contents Our ability to make scheduled payments of the principal and interest on our indebtedness when due, or to refinance our indebtedness as we may need or desire, depends on our future performance, which is subject to economic, financial, competitive and other factors beyond our control. Our business may not continue to generate cash flow from operations in the future sufficient to satisfy our obligations under our existing indebtedness and any future indebtedness we may incur, and to make necessary capital expenditures. If we are unable to generate such cash flow, we may be required to adopt one or more alternatives, such as reducing or delaying investments or capital expenditures, selling assets, refinancing or obtaining additional equity capital on terms that may be onerous or highly dilutive. Our ability to refinance existing or future indebtedness will depend on the capital markets and our financial condition at such time. In addition, our ability to make payments may be limited by law, by regulatory authority or by agreements governing our future indebtedness. We may not be able to engage in these activities on desirable terms or at all, which may result in a default on our existing or future indebtedness and harm our financial condition and operating results. We are exposed to fluctuations in currency exchange rates. We transact business globally in multiple currencies and have foreign currency risks related to our revenue, costs of revenue, operating expenses and localized subsidiary debt denominated in currencies other than the U.S. dollar. To the extent we have significant revenues denominated in such foreign currencies, any strengthening of the U.S. dollar would tend to reduce our revenues as measured in U.S. dollars, as we have historically experienced, and are currently experiencing. We have also experienced, and will continue to experience, fluctuations in our net income as a result of gains (losses) on the settlement and the re-measurement of monetary assets and liabilities denominated in currencies that are not the local currency (primarily cons",
  "egrity of our customers’ personal information, we may be required to expend significant resources to comply with data breach requirements if, for example, third parties improperly obtain and use the personal information of our customers or we otherwise experience a data loss with respect to the personal information we process and handle. A major breach of our network security and systems may occur despite defensive measures, and may result in fines, penalties and damages and harm our brand, prospects and operating results. We could be subject to liability, penalties and other restrictive sanctions and adverse consequences arising out of certain governmental investigations and proceedings. We are cooperating with certain government investigations as discussed in Note 14, Commitments and Contingencies , to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K. To our knowledge, no government agency in any such ongoing investigation has concluded that any wrongdoing occurred. However, we cannot predict the outcome or impact of any such ongoing matters, and there exists the possibility that we could be subject to liability, penalties and other restrictive sanctions and adverse consequences if the SEC, the U.S. Department of Justice or any other government agency were to pursue legal action in the future. Moreover, we expect to incur costs in responding to related requests for information and subpoenas, and if instituted, in defending against any governmental proceedings. We may face regulatory challenges to or limitations on our ability to sell vehicles directly. While we intend to continue to leverage our most effective sales strategies, including sales through our website, we may not be able to sell our vehicles through our own stores in certain states in the U.S. with laws that may be interpreted to impose limitations on this direct-to-consumer sales model. It has also been asserted that the laws in some states limit our ability to obtain dealer licenses from state motor vehicle regulators, and such assertions persist. In certain locations, decisions by regulators permitting us to sell vehicles have been, and may be, challenged by dealer associations and others as to whether such decisions comply with applicable state motor vehicle industry laws. We have prevailed in many of these lawsuits and such results have reinforced our continuing belief that state franchise laws were not intended to apply to a manufacturer that does not have franchise dealers anywhere in the world. In some states, there have also been regulatory and legislative efforts by dealer associations to propose laws that, if enacted, would prevent us from obtaining dealer licenses in their states given our current sales model. A few states have passed legislation that clarifies our ability to operate, but at the same time limits the number of dealer licenses we can obtain or stores that we can operate. The application of state laws applicable to our operations continues to be difficult to predict. Internationally, there may be laws in jurisdictions we have not yet entered or laws we are unaware of in jurisdictions we have entered that may restrict our sales or other business practices. Even for those jurisdictions we have analyzed, the laws in this area can be complex, di",
  "ng facilities. The following table sets forth the location of our primary owned and leased manufacturing facilities. Primary Manufacturing Facilities Location Owned or Leased Gigafactory Texas Austin, Texas Owned Fremont Factory Fremont, California Owned Gigafactory Nevada Sparks, Nevada Owned Gigafactory Berlin-Brandenburg Grunheide, Germany Owned Gigafactory Shanghai Shanghai, China * Megafactory Shanghai Shanghai, China * Gigafactory New York Buffalo, New York Leased Megafactory Lathrop Lathrop, California Leased * We own the building and the land use rights with an initial term of 50 years. The land use rights are treated as operating lease right-of-use assets. ITEM 3. LEGAL PROCEEDINGS For a description of our material pending legal proceedings, please see Note 14, Commitments and Contingencies , to the consolidated financial statements included elsewhere in this Annual Report on Form 10-K. ITEM 4. MINE SAFETY DISCLOSURES Not applicable. 29 PART II ITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES Market Information Our common stock has traded on The NASDAQ Global Select Market under the symbol “TSLA” since it began trading on June 29, 2010. Our initial public offering was priced at approximately $1.13 per share on June 28, 2010 as adjusted to give effect to the three-for-one stock split effected in the form of a stock dividend in August 2022 and the five-for-one stock split effected in the form of a stock dividend in August 2020. Holders As of January 22, 2025, there were 9,512 holders of record of our common stock. A substantially greater number of holders of our common stock are “street name” or beneficial holders, whose shares are held by banks, brokers and other financial institutions. Dividend Policy We have never declared or paid cash dividends on our common stock. We currently do not anticipate paying any cash dividends in the foreseeable future. Any future determination to declare cash dividends will be made at the discretion of our board of directors, subject to applicable laws, and will depend on our financial condition, results of operations, capital requirements, general business conditions and other factors that our board of directors may deem relevant. Stock Performance Graph This performance graph shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference into any filing of Tesla, Inc. under the Securities Act of 1933, as amended (the “Securities Act”), or the Exchange Act, except as shall be expressly set forth by specific reference in such filing. The following graph shows a comparison, from January 1, 2020 through December 31, 2024, of the cumulative total return on our common stock, The NASDAQ Composite Index and a group of all public companies sharing the same SIC code as us, which is SIC code 3711, “Motor Vehicles and Passenger Car Bodies” (Motor Vehicles and Passenger Car Bodies Public Company Group). Such returns are based on historical results and are not intended to suggest future performance. Data for The NASDAQ Composite Index and the Motor Vehicles and Passenger Car Bodies Public Company Group assumes an investment of $100 on January 1, 2020 and reinvestment of dividends. We ha",
  "f Société Générale, Wells Fargo Bank, National Association, Credit Suisse Capital LLC (later assigned to UBS AG, London Branch) and Goldman, Sachs & Co. LLC (together, the “2019 Warrantholders”). Between October 1, 2024 and October 15, 2024, we issued an aggregate of 2,894,424 shares of our common stock to the 2019 Warrantholders pursuant to their exercise of such warrants, which were net of the applicable exercise prices. Such shares were issued pursuant to an exemption from registration provided by Rule 3(a)(9) of the Securities Act of 1933. Purchases of Equity Securities by the Issuer and Affiliated Purchasers None. ITEM 6. [RESERVED] 31 ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS The following discussion and analysis should be read in conjunction with the consolidated financial statements and the related notes included elsewhere in this Annual Report on Form 10-K. For further discussion of our products and services, technology and competitive strengths, refer to Item 1- Business. For discussion related to changes in financial condition and the results of operations for fiscal year 2023-related items, refer to Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for fiscal year 2023, which was filed with the Securities and Exchange Commission on January 29, 2024. Overview and 2024 Highlights Our mission is to accelerate the world’s transition to sustainable energy. We design, develop, manufacture, lease and sell high-performance fully electric vehicles, solar energy generation systems and energy storage products. We also offer maintenance, installation, operation, charging, insurance, financial and other services related to our products. Additionally, we are increasingly focused on products and services based on AI, robotics and automation. In 2024, we produced approximately 1,773,000 consumer vehicles and delivered approximately 1,789,000 consumer vehicles. We are focused on profitable growth, including by leveraging existing factories and production lines to introduce new and more affordable products, further improving and deploying our FSD (Supervised) capabilities, including future autonomous capabilities through our purpose-built Robotaxi product, Cybercab, reducing costs, increasing vehicle production, utilized capacity and delivery capabilities, improving and developing our vehicles and battery technologies, vertically integrating and localizing our supply chain, and expanding our global infrastructure, including our service and charging infrastructure. In 2024, we deployed 31.4 GWh of energy storage products. We are focused on ramping the production and increasing the market penetration of our energy storage products. In 2024, we recognized total revenues of $97.69 billion, representing an increase of $917 million compared to the prior year. In 2024, our net income attributable to common stockholders was $7.09 billion, representing a decrease of $7.91 billion compared to the prior year, primarily due to the impact of releasing $6.54 billion of our valuation allowance associated with U.S. federal and state deferred tax assets in the fourth quarter of 2023.We continue to ramp production and build and optimize our manufacturing capac",
  "tanding, our sales growth is also generally facilitating positive cash generation. We have and will continue to utilize such cash flows, among other things, to invest in autonomy, do more vertical integration, expand our product roadmap and provide financing options to our customers. At the same time, we are likely to see heightened levels of capital expenditures during certain periods depending on the specific pace of our capital-intensive projects and other potential variables such as rising material prices and increases in supply chain and labor expenses resulting from changes in global trade conditions and labor availability. Overall, we expect our ability to be self-funding to continue as long as macroeconomic factors support current trends in our sales. 34 Critical Accounting Policies and Estimates The consolidated financial statements are prepared in accordance with accounting principles generally accepted in the U.S. (“GAAP”). The preparation of the consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, costs and expenses and related disclosures. We base our estimates on historical experience, as appropriate, and on various other assumptions that we believe to be reasonable under the circumstances. Changes in the accounting estimates are reasonably likely to occur from period to period. Accordingly, actual results could differ significantly from the estimates made by our management. We evaluate our estimates and assumptions on an ongoing basis. To the extent that there are material differences between these estimates and actual results, our future financial statement presentation, financial condition, results of operations and cash flows may be affected. The estimates used for, but not limited to, determining significant economic incentive for resale value guarantee arrangements, sales return reserves, resale value guarantee liabilities, income tax, the collectability of accounts and finance receivables, inventory valuation, warranties, fair value of long-lived assets, goodwill, fair value of financial instruments, fair value and residual value of operating lease vehicles and solar energy systems subject to leases could be impacted. We have assessed the impact and are not aware of any specific events or circumstances that required an update to our estimates and assumptions or materially affected the carrying value of our assets or liabilities as of the date of issuance of this Annual Report on Form 10-K. These estimates may change as new events occur and additional information is obtained. Actual results could differ materially from these estimates under different assumptions or conditions. Revenue Recognition Automotive Sales Automotive sales revenue includes revenues related to cash and financing deliveries of new vehicles, and specific other features and services that meet the definition of a performance obligation under Accounting Standards Codification 606, Revenue from Contracts with Customers (“ASC 606”), including access to our FSD (Supervised) features and their ongoing maintenance, internet connectivity, free Supercharging programs and over-the-air software updates. We recognize revenue on automotive sales upon delivery to the customer, which is when the control of"
]